#+TITLE: Informatics basics
#+AUTHOR: Starovoytov Alexandr, Grechko Georgy
#+DATE: <2021-09-25 Sat 15:50>
#+SETUPFILE: retro_dark.theme

[[https://github.com/stewkk/iu9-scheme/][Лабы и дз]]

** операторы
#+begin_src scheme :session :results value :exports both
;; <терм> ::= <атом>|<список>
;; <атом> ::= <перем>|<число>|<симол>|<строка>
;; <список> ::= (<термы>)
;; <термы> ::= <пусто> | <терм><термы>
;; <пусто> ::=
;; i-am-variable - имя переменной может включать "-", "+", "*", "/"...
(+ 1 2 3) ;; список
;; "+" - имя функции сложения
;; "1 2 3" - аргументы
;; элементы списка разделяются пробелами

#+end_src

#+RESULTS:
: 6

#+begin_src scheme :session :exports both
((a 1)(b 2)(c 3)) ;; список списков

;; по умолчанию выражение вида
;; (f a b c) - вызов функции
;; ((f x) y) - сначала вызывается (f x),
;; то, что она вычислит с аргументом y
;; Особая форма - первый элемент списка - ключевое слово

(define pi 3.1415926)
;; pi - имя переменной
;; 3.14.. - значение

(define pi (* 4 (atan 1)))

(define (f a b c) ;; опеределяет функции
    (+ (* 2 a) (/ b c)))

;; (if <выраж 1>
;;     <выраж 2>
;;     <выраж 3>)

;; Если <выраж 1> - ложь,
;; значением (if ...) станет значение <выраж3>
;; (<выраж 2> не вычисляется), и наоборот

;; #f - ложь
;; #t - истина
;; if считает истиной все что не ложь
#+end_src


#+begin_src scheme :session :exports both
(if 1 2 3)
#+end_src

#+RESULTS:
: 2

#+begin_src scheme :session :exports both
(if #f (/ 1 0) (/ 10 5))

#+end_src

#+RESULTS:
: 2

#+begin_src scheme :exports both
(if #t (/ 1 0) (/ 10 5))
#+end_src

#+RESULTS:
: Throw to key `numerical-overflow' with args `("/" "Numerical overflow" #f #f)'.

#+begin_src scheme
;; (< x y)
;; (> x y)
;; (= x y)
;; >=
;; <=
;; (/ x y)
(/ 10 3)
#+end_src

#+RESULTS:
: 10/3

#+begin_src scheme :session :exports both
;; (quotient x y) - целое деление
(quotient 30 7)
#+end_src

#+RESULTS:
: 4

#+begin_src scheme :session :exports both
;; (remainder x y) -> остаток
(remainder 30 7)
#+end_src

#+RESULTS:
: 2

#+begin_src scheme :session :exports both
;; "особые формы"
;; (and e1 e2 ... en) - возвращает #f если хотя бы один ei = #f, иначе en
;; (or ...) - вернет первое не ложное значение


(and 1 2 #f (/ 1 0))
#+end_src

#+RESULTS:
: #f
#+begin_src scheme :session :exports both
;; (or (= x 0) (/ 1 x)) - не приведет к ошибке деления на 0, никогда
#+end_src

#+begin_src scheme :session :exports both
(or (= 1 0) (/ 1 0))
#+end_src

#+RESULTS:

#+begin_src scheme :session :exports both
;; (not x) - логическое отрицание #f -> #t
;; not x -> #f, x != #f
;; вычисления ленивые!
#+end_src

#+begin_src scheme :exports both
(+ 1 2 3)
#+end_src

#+RESULTS:
: 6

#+begin_src scheme :session :exports both
(define pi (* 4 (atan 1)))
#+end_src
#+begin_src scheme :session :exports both
(define (area r) (* r r))
#+end_src
#+begin_src scheme :session :exports both
(define e (exp 1))
#+end_src
#+begin_src scheme :session :exports both
(define (hypot x y) (sqrt (+ (* x x) (* y y))))
; if всегда в 3 строки
#+end_src
#+begin_src scheme :session :exports both
(define (fac x) (if (= x 0)
                     1 (* (fac (- x 1)) x)))
#+end_src
#+begin_src scheme :session :exports both
(define (my-positive? n) (> n 0))
#+end_src
#+begin_src scheme :session :exports both
(define (my-abs x)
  (if (< x 0)
      (-x)
      x))

#+end_src
#+begin_src scheme :session :exports both
(define (factorial n)
  (define loop acc i)
  (if (> i n)
      acc
      (loop (* acc i) (+ i 1)))
  (loop 1 1))
#+end_src
#+begin_src scheme :session
(define (my-odd n)
  (= 0 (remainder n 2)))
#+end_src

#+RESULTS:
: #<unspecified>

#+begin_src scheme :session
(define (my-even n)
  (= 1 (remainder n 2)))
#+end_src

#+RESULTS:
: #<unspecified>

#+begin_src scheme :session :exports both
(my-odd 1)
#+end_src

#+RESULTS:
: #f

#+begin_src scheme :session :exports both
(my-odd 2)
#+end_src

#+RESULTS:
: #t

#+begin_src scheme :session :exports both
(my-even 1)
#+end_src

#+RESULTS:
: #t

#+begin_src scheme :session :exports both
(my-even 2)
#+end_src

#+RESULTS:
: #f

*** списки
Список - последовательность значений,
основная структура данных в языках семейства LISP \\
Во время выполнения выглядит примерно так:
#+begin_src scheme
(1 2 3 4)
#+end_src
Создание списка:
#+begin_src scheme
(list <элементы>)
(list 1 2 3 4) -> (1 2 3 4)
(list) -> () - пустой список
#+end_src
Операции над списками:
1. cons

   #+begin_src scheme
   (cons <голова> <хвост>) -> <список>
   <голова> - некоторое значение
   <хвост> - список
   #+end_src
   Строит список, где первый элемент голова, а все остальные хвост
   #+begin_src scheme :results raw :exports both
(define odds (list 3 5 7))
(cons 2 odds)
   #+end_src

   #+RESULTS:
   (2 3 5 7)

   #+begin_src scheme
(cons 1 (cons 9 odds)) -> (1 9 3 5 7)
(cons 'x (list)) -> (x)
   #+end_src
#+begin_src scheme
(list? <значение>) -> ;; #t | #f
(list? odds) -> #t
(list? 7) -> #f
;; это предикат типа
(null? <список>) -> <лог значение>
#t - пустой
#f - непустой
(null? odd) -> #f
(null? (list)) -> #t
(car <список>) -> <голова> ;; content of address register
(cdr <список>) -> <хвост> ;; content of destination register
cdr - все кроме головы
(car odds) -> 3
(cdr odds) -> (5 7)
(car (cdr odds)) -> 5
(cdr (cdr odds)) -> 7
(cdr (cdr (cdr odds))) -> ()
(cadr ....) == (car (cdr ..))
(caar ...) == (car (car ...))
(cdadr ....) == (cdr (car (cdr ....)))
выполняется справа налево
#+end_src
#+begin_src scheme
(define nested (list (list 1 2)
                     (list 3 4)))
nested -> ((1 2) (3 4))
(cdar nested) == (cdr (car nested)) -> (2)
(car nested) -> (1 2)
(cdr nested) -> ((3 4))
(cadr nested) -> (3 4)
(caadr nested) -> 3
(cdadr nested) -> (4)

#+end_src
*** Сравнение на равенство
#+begin_src scheme
(= x y) ;; работает только с числом
;; функции, работающие со всем:
(equal? x y) ;; сравнивает по значению
(eqv? x y), (eq? x y) ;; сравнивают по ссылке, разницу смотреть в документации
;; рекомендуется всегда использовать (equal?), результат наиболее предсказуем
#+end_src
#+begin_src scheme :exports both
(= 3 3.0)
#+end_src

#+RESULTS:
: #t

#+begin_src scheme :exports both
(equal? 3 3.0)
#+end_src

#+RESULTS:
: #f

#+begin_src scheme :exports both
(eq? (list 1 2 3) (list 1 2 3))
#+end_src

#+RESULTS:
: #f

#+begin_src scheme :exports both
(equal? (list 1 2 3) (list 1 2 3))
#+end_src

#+RESULTS:
: #t

#+begin_src scheme :session :exports both
(define xs (list 1 2 3))
(eq? xs xs)
#+end_src

#+RESULTS:
: #t

#+begin_src scheme :session :exports both
(equal? xs xs)
#+end_src

#+RESULTS:
: #t

